split/html/olpc-deployment-guide-olpc-learning-strategy.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="fr" xml:lang="fr">
<head>
<title>OLPC Learning Strategy</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-09-12"/>
<meta name="author" content="OLPC Foundation (c) 2011 One Laptop Per Child Association, Inc."/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="style.css" type="text/css" />

</head>
<body>


<div id="content">
<h1 class="title">OLPC Learning Strategy</h1>

<p>“It’s an education project, not a laptop project”
</p>

<p>
OLPC’s principles are based on the learning theory of Constructionism,
which refers to the concept of “learning by doing”.  Seymour Papert, a
mathematician, computer scientist, and educator; developed the theory of
Constructionism built upon the work of renown Swiss psychologist of Jean
Piaget on Constructivism learning theories.
</p>
<p>
Papert explained that learning is most effective when the learner is
engaged in the construction of a meaningful product, and that technology
can become the tool for building knowledge.  He made the first and most
important efforts to provide children with control of new technologies.
Based on his research he suggests all children should learn to program the
computer, because this allows them to develop unique skills that empower
learners to learn about the way they learn.
</p>
<p>
OLPC’s philosophy is inspired by Papert and other progressive educators who
share his ideas about learning.  We believe the laptop is the agency to
engage children in constructing knowledge based upon their personal
interests.  The laptop provides children with tools for sharing and
critiquing these constructions which will lead them to become better
learners and teachers.  Therefore, OLPC does not focus on computer
literacy, as that is a by-product of the fluency children will gain
through use of the laptop for learning.
</p>
<p>
OLPC learning strategy focuses on building:
</p>

<ul>
<li>Developing Digital Fluency.  This refers to computer programming skills
  and to the ability to build things of significance with technological
  tools.  “A technologically fluent person should be able to go from the
  germ of an intuitive idea to the implementation of a technological
  project (Papert &amp; Resnick, 1995)”.

</li>
<li>Reflecting about learning, learning to learn and thinking about
  self-learning strategies.

</li>
<li>Building learning and innovation skills in alignment to with the 21st
  Century Skills:

<ul>
<li>Creativity and Innovation
</li>
<li>Critical Thinking and Problem Solving
</li>
<li>Communication and Collaboration
</li>
</ul>

</li>
</ul>


<p>
<b>Software : The Sugar Learning Platform</b>
</p>

<p>
In accordance with the learning theory of Constructionism and OLPC’s
principle of Open Software, Sugar provides the appropriate platform to
achieve OLPC’s learning strategies and mission.  With Sugar’s Activities,
children engage in exploring knowledge, in expressing themselves through
different media and in computer programming skills.  Sugar promotes
collaborative learning through Activities that encourage critical thinking,
collaboration, and reflection.
</p>
</div>

</body>
</html>
